Catalogs/CRM_ВидыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>CRM_ВидыСобытий</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветТекста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбластиПрименения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Область</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Renault_ОбластиПрименения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/CRM_ВидыСобытий/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.РежимВыбора Тогда Элементы.Список.РежимВыбора=Истина КонецЕсли;
	УстановитьУсловноеОформление();
КонецПроцедуры

Процедура УстановитьУсловноеОформление() //установим оформление для отображения цветов 	
	
	Список.УсловноеОформление.Элементы.Очистить();
	Запрос=Новый Запрос("Выбрать Ссылка,ЦветФона,ЦветТекста Из Справочник.CRM_ВидыСобытий ГДЕ ЦветФона<>"""" или ЦветТекста<>"""" Итоги По ЦветФона,ЦветТекста");	
	гр1=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока гр1.Следующий() Цикл
		гр2=гр1.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока гр2.Следующий() Цикл
			
			//все ссылки сгруппированные по ЦветФона,ЦветТекста
			Сп=Новый СписокЗначений;
			Выборка=гр2.Выбрать();
			Пока Выборка.Следующий() Цикл Сп.Добавить(Выборка.Ссылка) КонецЦикла;	
			
			//добавим условное оформление
			Эл=Список.УсловноеОформление.Элементы.Добавить();
			
			Отбор=Эл.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Отбор.ВидСравнения=ВидСравненияКомпоновкиДанных.ВСписке;
			Отбор.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Ссылка");
			Отбор.ПравоеЗначение=Сп;
			Отбор.Использование=Истина;                        
			
			Оформление=Эл.Оформление.Элементы.Найти("ЦветФона");
			Оформление.Использование=Истина;
			Оформление.Значение=Обработки.Renault_ДиалогВыбораЦвета.ЦветИзСтроки(гр2.ЦветФона);
			
			Оформление=Эл.Оформление.Элементы.Найти("ЦветТекста");
			Оформление.Использование=Истина;
			Оформление.Значение=Обработки.Renault_ДиалогВыбораЦвета.ЦветИзСтроки(гр2.ЦветТекста);
			
			ЭлПоле=Эл.Поля.Элементы.Добавить();
			ЭлПоле.Использование=Истина;
			ЭлПоле.Поле=Новый ПолеКомпоновкиДанных("Код");
			
			ЭлПоле=Эл.Поля.Элементы.Добавить();
			ЭлПоле.Использование=Истина;
			ЭлПоле.Поле=Новый ПолеКомпоновкиДанных("Наименование");
			
			
		КонецЦикла;	
	КонецЦикла;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка) УстановитьУсловноеОформление() КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник) Если ИмяСобытия="ЗаписьВидаСобытия" Тогда УстановитьУсловноеОформление() КонецЕсли КонецПроцедуры
